# ReferencingOption Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
DirectShapeOptions..::..ReferencingOption Property
DirectShapeOptions Class See Also
---
Whether or not the geometry stored in a DirectShape object may be referenced.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public DirectShapeReferencingOption ReferencingOption { get; set; }
```

Visual Basic
---
```text
Public Property ReferencingOption As DirectShapeReferencingOption
	Get
	Set
```

Visual C++
---
```text
public:
property DirectShapeReferencingOption ReferencingOption {
	DirectShapeReferencingOption get ();
	void set (DirectShapeReferencingOption value);
}
```

# ### Field Value
The default value is Referenceable.
# Remarks
If the geometry is not referenceable, it may not be used for dimensioning, snapping, alingment, or face-hosting. The element may still be selected by the user for operations which do not reference individual geometry objects.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
DirectShapeOptions Class
Autodesk.Revit.DB Namespace